Revit 2020 API
PlasticVinyl Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class PlasticVinyl
Visual Basic
Public NotInheritable Class PlasticVinyl
Visual C++
public ref class PlasticVinyl abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.PlasticVinyl
See Also
PlasticVinyl Members
Autodesk.Revit.DB.Visual Namespace